Note/MIT6.828.lab2.org
#+Title:  MIT6.828 Lab 2
#+Author: Comcx


#+SETUPFILE: theme-readtheorg-local.setup

Let's make abstractions of memory space!

#+BEGIN_QUOTE
Lab 2 contains the following new source files, which you should browse through:

#+BEGIN_SRC 
inc/memlayout.h
kern/pmap.c
kern/pmap.h
kern/kclock.h
kern/kclock.c
#+END_SRC

=memlayout.h= describes the layout of the virtual address space that you must implement by modifying pmap.c. 
=memlayout.h= and =pmap.h= define the PageInfo structure that you'll use to keep track of which pages of physical memory are free. 
=kclock.c= and =kclock.h= manipulate the PC's battery-backed clock and CMOS RAM hardware, 
in which the BIOS records the amount of physical memory the PC contains, among other things. 
The code in pmap.c needs to read this device hardware in order to figure out how much physical memory there is, 
but that part of the code is done for you: you do not need to know the details of how the CMOS hardware works.

Pay particular attention to =memlayout.h= and =pmap.h=, since this lab requires you to use and understand many of the definitions they contain. 
You may want to review =inc/mmu.h=, too, as it also contains a number of definitions that will be useful for this lab.
#+END_QUOTE


** Part 1: Physical Page Management
*** Exercise 1
#+BEGIN_QUOTE
In the file kern/pmap.c, you must implement code for the following functions (probably in the order given).

#+BEGIN_SRC 
boot_alloc()
mem_init() (only up to the call to check_page_free_list(1))
page_init()
page_alloc()
page_free()
#+END_SRC

=check_page_free_list()= and =check_page_alloc()= test your physical page allocator. 
You should boot JOS and see whether =check_page_alloc()= reports success. 
Fix your code so that it passes. You may find it helpful to add your own assert()s to verify that your assumptions are correct.
#+END_QUOTE
Before writing codes, I need to read and understand =kern/pmap.h= and =inc/memlayout.h= first.

