Note/MIT6.828.lab2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-06 Mon 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MIT6.828 Lab 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="../images/digimon-icon.png" />
</head>
<body>
<div id="content">
<h1 class="title">MIT6.828 Lab 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8557828">1. Part 1: Physical Page Management</a>
<ul>
<li><a href="#orgb511fca">1.1. Exercise 1</a>
<ul>
<li><a href="#orgeef8b1d">1.1.1. <code>inc/memlayout.h</code></a></li>
<li><a href="#org1fad0ec">1.1.2. <code>kern/pmap.h</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1b4d737">2. Part 2: Virtual Memory</a>
<ul>
<li><a href="#orgb9e2dfc">2.1. Exercise 2</a></li>
<li><a href="#org2e2b636">2.2. Exercise 3</a>
<ul>
<li><a href="#orgac7c281">2.2.1. Question</a></li>
</ul>
</li>
<li><a href="#org451f040">2.3. Exercise 4</a></li>
</ul>
</li>
<li><a href="#org6305f53">3. Part 3: Kernel Address Space</a></li>
</ul>
</div>
</div>
<p>
Let's make abstractions of memory space!
</p>

<blockquote>
<p>
Lab 2 contains the following new source files, which you should browse through:
</p>

<pre class="example">
inc/memlayout.h
kern/pmap.c
kern/pmap.h
kern/kclock.h
kern/kclock.c
</pre>

<p>
<code>memlayout.h</code> describes the layout of the virtual address space that you must implement by modifying pmap.c. 
<code>memlayout.h</code> and <code>pmap.h</code> define the PageInfo structure that you'll use to keep track of which pages of physical memory are free. 
<code>kclock.c</code> and <code>kclock.h</code> manipulate the PC's battery-backed clock and CMOS RAM hardware, 
in which the BIOS records the amount of physical memory the PC contains, among other things. 
The code in pmap.c needs to read this device hardware in order to figure out how much physical memory there is, 
but that part of the code is done for you: you do not need to know the details of how the CMOS hardware works.
</p>

<p>
Pay particular attention to <code>memlayout.h</code> and <code>pmap.h</code>, since this lab requires you to use and understand many of the definitions they contain. 
You may want to review <code>inc/mmu.h</code>, too, as it also contains a number of definitions that will be useful for this lab.
</p>
</blockquote>


<div id="outline-container-org8557828" class="outline-2">
<h2 id="org8557828"><span class="section-number-2">1</span> Part 1: Physical Page Management</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb511fca" class="outline-3">
<h3 id="orgb511fca"><span class="section-number-3">1.1</span> Exercise 1</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
In the file kern/pmap.c, you must implement code for the following functions (probably in the order given).
</p>

<pre class="example">
boot_alloc()
mem_init() (only up to the call to check_page_free_list(1))
page_init()
page_alloc()
page_free()
</pre>

<p>
<code>check_page_free_list()</code> and <code>check_page_alloc()</code> test your physical page allocator. 
You should boot JOS and see whether <code>check_page_alloc()</code> reports success. 
Fix your code so that it passes. You may find it helpful to add your own assert()s to verify that your assumptions are correct.
</p>
</blockquote>
<p>
Before writing codes, I need to read and understand <code>kern/pmap.h</code> and <code>inc/memlayout.h</code> first.
</p>
</div>
