Note/MIT6.828.lab2.org
**** =inc/memlayout.h= 
Here we have the entire virtual memory map which we need to implement later.
#+BEGIN_SRC 
/*                                                                              
 * Virtual memory map:                                Permissions               
 *                                                    kernel/user               
 *                                                                              
 *    4 Gig -------->  +------------------------------+                         
 *                     |                              | RW/--                   
 *                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                         
 *                     :              .               :                         
 *                     :              .               :                         
 *                     :              .               :                         
 *                     |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~| RW/--                   
 *                     |                              | RW/--                   
 *                     |   Remapped Physical Memory   | RW/--                   
 *                     |                              | RW/--                   
 *    KERNBASE, ---->  +------------------------------+ 0xf0000000      --+     
 *    KSTACKTOP        |     CPU0's Kernel Stack      | RW/--  KSTKSIZE   |     
 *                     | - - - - - - - - - - - - - - -|                   |     
 *                     |      Invalid Memory (*)      | --/--  KSTKGAP    |     
 *                     +------------------------------+                   |     
 *                     |     CPU1's Kernel Stack      | RW/--  KSTKSIZE   |     
 *                     | - - - - - - - - - - - - - - -|                 PTSIZE  
 *                     |      Invalid Memory (*)      | --/--  KSTKGAP    |     
 *                     +------------------------------+                   |     
 *                     :              .               :                   |     
 *                     :              .               :                   |     
 *    MMIOLIM ------>  +------------------------------+ 0xefc00000      --+     
 *                     |       Memory-mapped I/O      | RW/--  PTSIZE           
 * ULIM, MMIOBASE -->  +------------------------------+ 0xef800000              
 *                     |  Cur. Page Table (User R-)   | R-/R-  PTSIZE           
 *    UVPT      ---->  +------------------------------+ 0xef400000              
 *                     |          RO PAGES            | R-/R-  PTSIZE           
 *    UPAGES    ---->  +------------------------------+ 0xef000000              
 *                     |           RO ENVS            | R-/R-  PTSIZE           
 * UTOP,UENVS ------>  +------------------------------+ 0xeec00000              
 * UXSTACKTOP -/       |     User Exception Stack     | RW/RW  PGSIZE           
 *                     +------------------------------+ 0xeebff000              
 *                     |       Empty Memory (*)       | --/--  PGSIZE           
 *    USTACKTOP  --->  +------------------------------+ 0xeebfe000              
 *                     |      Normal User Stack       | RW/RW  PGSIZE           
 *                     +------------------------------+ 0xeebfd000              
 *                     |                              |                         
 *                     |                              |                         
 *                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                         
 *                     .                              .                         
 *                     .                              .                         
 *                     .                              .                         
 *                     |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|                         
 *                     |     Program Data & Heap      |                         
 *    UTEXT -------->  +------------------------------+ 0x00800000              
 *    PFTEMP ------->  |       Empty Memory (*)       |        PTSIZE           
 *                     |                              |                         
 *    UTEMP -------->  +------------------------------+ 0x00400000      --+     
 *                     |       Empty Memory (*)       |                   |     
 *                     | - - - - - - - - - - - - - - -|                   |     
 *                     |  User STAB Data (optional)   |                 PTSIZE  
 *    USTABDATA ---->  +------------------------------+ 0x00200000        |     
 *                     |       Empty Memory (*)       |                   |     
 *    0 ------------>  +------------------------------+                 --+     
 *                                                                              
 * (*) Note: The kernel ensures that "Invalid Memory" is *never* mapped.        
 *     "Empty Memory" is normally unmapped, but user programs may map pages     
 *     there if desired.  JOS user programs map pages temporarily at UTEMP.     
 */
#+END_SRC

Moreover, we can find definition of _free-page-list_ .
#+BEGIN_SRC c
/*                                                                              
 * Page descriptor structures, mapped at UPAGES.                                
 * Read/write to the kernel, read-only to user programs.                        
 *                                                                              
 * Each struct PageInfo stores metadata for one physical page.                  
 * Is it NOT the physical page itself, but there is a one-to-one                
 * correspondence between physical pages and struct PageInfo's.                 
 * You can map a struct PageInfo * to the corresponding physical address        
 * with page2pa() in kern/pmap.h.                                               
 */
struct PageInfo {
	// Next page on the free list.                                          
	struct PageInfo *pp_link;

	// pp_ref is the count of pointers (usually in page table entries)      
	// to this page, for pages allocated using page_alloc.                  
	// Pages allocated at boot time using pmap.c's                          
	// boot_alloc do not have valid reference count fields.                 

	uint16_t pp_ref;
};
#+END_SRC

**** =kern/pmap.h= 
This is the core of memory mangement.
It can be found that in lab1, function =i386_init= in =kern/init.c= calls =mem_init= which is defined in =pmap.c= .
In =mem_init= , =boot_alloc= is first called, thus we need to implement =boot_alloc= first.

