Note/MIT6.828.lab2.html

<div id="outline-container-orgeef8b1d" class="outline-4">
<h4 id="orgeef8b1d"><span class="section-number-4">1.1.1</span> <code>inc/memlayout.h</code></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Here we have the entire virtual memory map which we need to implement later.
</p>
<pre class="example">
/*                                                                              
 * Virtual memory map:                                Permissions               
 *                                                    kernel/user               
 *                                                                              
 *    4 Gig --------&gt;  +------------------------------+                         
 *                     |                              | RW/--                   
 *                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                         
 *                     :              .               :                         
 *                     :              .               :                         
 *                     :              .               :                         
 *                     |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~| RW/--                   
 *                     |                              | RW/--                   
 *                     |   Remapped Physical Memory   | RW/--                   
 *                     |                              | RW/--                   
 *    KERNBASE, ----&gt;  +------------------------------+ 0xf0000000      --+     
 *    KSTACKTOP        |     CPU0's Kernel Stack      | RW/--  KSTKSIZE   |     
 *                     | - - - - - - - - - - - - - - -|                   |     
 *                     |      Invalid Memory (*)      | --/--  KSTKGAP    |     
 *                     +------------------------------+                   |     
 *                     |     CPU1's Kernel Stack      | RW/--  KSTKSIZE   |     
 *                     | - - - - - - - - - - - - - - -|                 PTSIZE  
 *                     |      Invalid Memory (*)      | --/--  KSTKGAP    |     
 *                     +------------------------------+                   |     
 *                     :              .               :                   |     
 *                     :              .               :                   |     
 *    MMIOLIM ------&gt;  +------------------------------+ 0xefc00000      --+     
 *                     |       Memory-mapped I/O      | RW/--  PTSIZE           
 * ULIM, MMIOBASE --&gt;  +------------------------------+ 0xef800000              
 *                     |  Cur. Page Table (User R-)   | R-/R-  PTSIZE           
 *    UVPT      ----&gt;  +------------------------------+ 0xef400000              
 *                     |          RO PAGES            | R-/R-  PTSIZE           
 *    UPAGES    ----&gt;  +------------------------------+ 0xef000000              
 *                     |           RO ENVS            | R-/R-  PTSIZE           
 * UTOP,UENVS ------&gt;  +------------------------------+ 0xeec00000              
 * UXSTACKTOP -/       |     User Exception Stack     | RW/RW  PGSIZE           
 *                     +------------------------------+ 0xeebff000              
 *                     |       Empty Memory (*)       | --/--  PGSIZE           
 *    USTACKTOP  ---&gt;  +------------------------------+ 0xeebfe000              
 *                     |      Normal User Stack       | RW/RW  PGSIZE           
 *                     +------------------------------+ 0xeebfd000              
 *                     |                              |                         
 *                     |                              |                         
 *                     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                         
 *                     .                              .                         
 *                     .                              .                         
 *                     .                              .                         
 *                     |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|                         
 *                     |     Program Data &amp; Heap      |                         
 *    UTEXT --------&gt;  +------------------------------+ 0x00800000              
 *    PFTEMP -------&gt;  |       Empty Memory (*)       |        PTSIZE           
 *                     |                              |                         
 *    UTEMP --------&gt;  +------------------------------+ 0x00400000      --+     
 *                     |       Empty Memory (*)       |                   |     
 *                     | - - - - - - - - - - - - - - -|                   |     
 *                     |  User STAB Data (optional)   |                 PTSIZE  
 *    USTABDATA ----&gt;  +------------------------------+ 0x00200000        |     
 *                     |       Empty Memory (*)       |                   |     
 *    0 ------------&gt;  +------------------------------+                 --+     
 *                                                                              
 * (*) Note: The kernel ensures that "Invalid Memory" is *never* mapped.        
 *     "Empty Memory" is normally unmapped, but user programs may map pages     
 *     there if desired.  JOS user programs map pages temporarily at UTEMP.     
 */
</pre>

<p>
Moreover, we can find definition of <span class="underline">free-page-list</span> .
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">/*                                                                              </span>
<span style="color: #888a85; font-style: italic;"> * Page descriptor structures, mapped at UPAGES.                                </span>
<span style="color: #888a85; font-style: italic;"> * Read/write to the kernel, read-only to user programs.                        </span>
<span style="color: #888a85; font-style: italic;"> *                                                                              </span>
<span style="color: #888a85; font-style: italic;"> * Each struct PageInfo stores metadata for one physical page.                  </span>
<span style="color: #888a85; font-style: italic;"> * Is it NOT the physical page itself, but there is a one-to-one                </span>
<span style="color: #888a85; font-style: italic;"> * correspondence between physical pages and struct PageInfo's.                 </span>
<span style="color: #888a85; font-style: italic;"> * You can map a struct PageInfo * to the corresponding physical address        </span>
<span style="color: #888a85; font-style: italic;"> * with page2pa() in kern/pmap.h.                                               </span>
<span style="color: #888a85; font-style: italic;"> </span><span style="color: #888a85; font-style: italic;">*/</span>
<span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">PageInfo</span> <span style="color: #ffd700;">{</span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Next page on the free list.                                          </span>
        <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">PageInfo</span> *<span style="color: #ff6347; font-weight: bold;">pp_link</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">pp_ref is the count of pointers (usually in page table entries)      </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">to this page, for pages allocated using page_alloc.                  </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Pages allocated at boot time using pmap.c's                          </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">boot_alloc do not have valid reference count fields.                 </span>

        <span style="color: #8ae234; font-weight: bold;">uint16_t</span> <span style="color: #ff6347; font-weight: bold;">pp_ref</span>;
<span style="color: #ffd700;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fad0ec" class="outline-4">
<h4 id="org1fad0ec"><span class="section-number-4">1.1.2</span> <code>kern/pmap.h</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This is the core of memory mangement.
It can be found that in lab1, function <code>i386_init</code> in <code>kern/init.c</code> calls <code>mem_init</code> which is defined in <code>pmap.c</code> .
In <code>mem_init</code> , <code>boot_alloc</code> is first called, thus we need to implement <code>boot_alloc</code> first.
</p>
</div>

<ol class="org-ol">
