Note/MIT6.828.lab2.org
***** =boot_alloc= 
#+BEGIN_SRC c
// This simple physical memory allocator is used only while JOS is setting                          
// up its virtual memory system.  page_alloc() is the real allocator.                               
//                                                                                                  
// If n>0, allocates enough pages of contiguous physical memory to hold 'n'                         
// bytes.  Doesn't initialize the memory.  Returns a kernel virtual address.                        
//                                                                                                  
// If n==0, returns the address of the next free page without allocating                            
// anything.                                                                                        
//                                                                                                  
// If we're out of memory, boot_alloc should panic.                                                 
// This function may ONLY be used during initialization,                                            
// before the page_free_list list has been set up.                                                  
static void *
boot_alloc(uint32_t n)
{
        static char *nextfree;  // virtual address of next byte of free memory                      
        char *result;

        // Initialize nextfree if this is the first time.                                           
        // 'end' is a magic symbol automatically generated by the linker,                           
        // which points to the end of the kernel's bss segment:                                     
        // the first virtual address that the linker did *not* assign                               
        // to any kernel code or global variables.                                                  
        if (!nextfree) {
                extern char end[];
                nextfree = ROUNDUP((char *) end, PGSIZE);
        }

        // Allocate a chunk large enough to hold 'n' bytes, then update                             
        // nextfree.  Make sure nextfree is kept aligned                                            
        // to a multiple of PGSIZE.                                                                 
        //                                                                                          
        // LAB 2: Your code here.                                                                 
        result = nextfree;
        nextfree = ROUNDUP((char *)result + n, PGSIZE);
	if((uint32_t)nextfree > KERNBASE + (npages * PGSIZE)) {
	        panic("Out of memory!\n");
	}
        cprintf("boot_alloc 1st memory at %x, next memory allocated at %x\n",
                result, nextfree);

        return result;
}
#+END_SRC
=boot_alloc= does two things:
1) Initialize the 1st address which is never used,
2) Allocate a chunk to hold n bytes and return its address.

*Note* :
1) static variables inside function will always be initialized.
2) Variable =end= is the end of kernel, as =.bss= is the bottom of ELF file.
3) Macro =ROUNDUP= is defined in =inc/types.h= which is used to align.

***** =mem_init= 
Next, the main init part.

- =PADDR= is defined in =kern/pmap.h= .
- =PDX= (Page Directory indeX), =PTX= (Page Table indeX) is defined in =inc/mmu.h= .

