Note/MIT6.828.lab2.html
<li><a id="org8436279"></a><code>boot_alloc</code><br />
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">This simple physical memory allocator is used only while JOS is setting                          </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">up its virtual memory system.  page_alloc() is the real allocator.                               </span>
<span style="color: #888a85; font-style: italic;">//                                                                                                  </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">If n&gt;0, allocates enough pages of contiguous physical memory to hold 'n'                         </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">bytes.  Doesn't initialize the memory.  Returns a kernel virtual address.                        </span>
<span style="color: #888a85; font-style: italic;">//                                                                                                  </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">If n==0, returns the address of the next free page without allocating                            </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">anything.                                                                                        </span>
<span style="color: #888a85; font-style: italic;">//                                                                                                  </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">If we're out of memory, boot_alloc should panic.                                                 </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">This function may ONLY be used during initialization,                                            </span>
<span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">before the page_free_list list has been set up.                                                  </span>
<span style="color: #729fcf; font-weight: bold;">static</span> <span style="color: #8ae234; font-weight: bold;">void</span> *
<span style="color: #edd400; font-weight: bold;">boot_alloc</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span> <span style="color: #ff6347; font-weight: bold;">n</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #729fcf; font-weight: bold;">static</span> <span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ff6347; font-weight: bold;">nextfree</span>;  <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">virtual address of next byte of free memory                      </span>
        <span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ff6347; font-weight: bold;">result</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Initialize nextfree if this is the first time.                                           </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">'end' is a magic symbol automatically generated by the linker,                           </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">which points to the end of the kernel's bss segment:                                     </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">the first virtual address that the linker did *not* assign                               </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">to any kernel code or global variables.                                                  </span>
        <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #00bfff;">(</span>!nextfree<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
                <span style="color: #729fcf; font-weight: bold;">extern</span> <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347; font-weight: bold;">end</span><span style="color: #ffa500;">[]</span>;
                nextfree = ROUNDUP<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ff7f50;">)</span> end, PGSIZE<span style="color: #ffa500;">)</span>;
        <span style="color: #00bfff;">}</span>

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Allocate a chunk large enough to hold 'n' bytes, then update                             </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">nextfree.  Make sure nextfree is kept aligned                                            </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">to a multiple of PGSIZE.                                                                 </span>
        <span style="color: #888a85; font-style: italic;">//                                                                                          </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">LAB 2: Your code here.                                                                 </span>
        result = nextfree;
        nextfree = ROUNDUP<span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ffa500;">)</span>result + n, PGSIZE<span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span><span style="color: #ffa500;">)</span>nextfree &gt; KERNBASE + <span style="color: #ffa500;">(</span>npages * PGSIZE<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
                panic<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">"Out of memory!\n"</span><span style="color: #ffa500;">)</span>;
        <span style="color: #00bfff;">}</span>
        cprintf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"boot_alloc 1st memory at %x, next memory allocated at %x\n"</span>,
                result, nextfree<span style="color: #00bfff;">)</span>;

        <span style="color: #729fcf; font-weight: bold;">return</span> result;
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
<code>boot_alloc</code> does two things:
</p>
<ol class="org-ol">
<li>Initialize the 1st address which is never used,</li>
<li>Allocate a chunk to hold n bytes and return its address.</li>
</ol>

<p>
<b>Note</b> :
</p>
<ol class="org-ol">
<li>static variables inside function will always be initialized.</li>
<li>Variable <code>end</code> is the end of kernel, as <code>.bss</code> is the bottom of ELF file.</li>
<li>Macro <code>ROUNDUP</code> is defined in <code>inc/types.h</code> which is used to align.</li>
</ol>
</div>
</li>

<li><a id="org289c11d"></a><code>mem_init</code><br />
<div class="outline-text-5" id="text-1-1-2-2">
<p>
Next, the main init part.
</p>

<ul class="org-ul">
<li><code>PADDR</code> is defined in <code>kern/pmap.h</code> .</li>
<li><code>PDX</code> (Page Directory indeX), <code>PTX</code> (Page Table indeX) is defined in <code>inc/mmu.h</code> .</li>
</ul>
</div>
</li>
