Note/MIT6.828.lab2.org
***** =page_init= 
#+BEGIN_SRC c
 void
 page_init(void)
 {
 // The example code here marks all physical pages as free.              
 // However this is not truly the case.  What memory is free?            
 //  1) Mark physical page 0 as in use.                                  
 //     This way we preserve the real-mode IDT and BIOS structures       
 //     in case we ever need them.  (Currently we don't, but...)         
 //  2) The rest of base memory, [PGSIZE, npages_basemem * PGSIZE)       
 //     is free.                                                         
 //  3) Then comes the IO hole [IOPHYSMEM, EXTPHYSMEM), which must       
 //     never be allocated.                                              
 //  4) Then extended memory [EXTPHYSMEM, ...).                          
 //     Some of it is in use, some is free. Where is the kernel          
 //     in physical memory?  Which pages are already in use for          
 //     page tables and other data structures?                           
 //                                                                      
 // Change the code to reflect this.                                     
 // NB: DO NOT actually touch the physical memory corresponding to       
 // free pages!                                                          
 size_t i;
 for (i = 0; i < npages; i++) {
                  if(i == 0) {
                          //Page 1 as used                                        
                          pages[i].pp_ref = 1;
                          pages[i].pp_link = NULL;
                  }
                  else if(i < npages_basemem) {
                          //Rest of base mem as free                              
                          pages[i].pp_ref = 0;
                          pages[i].pp_link = page_free_list;
                          page_free_list = &pages[i];
                  }
                  else if(i >= IOPHYSMEM/PGSIZE && i < EXTPHYSMEM/PGSIZE) {
                          // IO hole                                              
                          pages[i].pp_ref = 1;
                          pages[i].pp_link = NULL;
                  }
                  else if(i >= EXTPHYSMEM/PGSIZE &&
                          i < PADDR(boot_alloc(0))/PGSIZE) {
                          pages[i].pp_ref = 1;
                          pages[i].pp_link = NULL;
                  }
                  else {
                          pages[i].pp_ref = 0;
                          pages[i].pp_link = page_free_list;
                          page_free_list = &pages[i];
                  }
          }
  }
#+END_SRC

***** =page_alloc= and =page_free= 
#+BEGIN_SRC c
struct PageInfo *
page_alloc(int alloc_flags)
{
        // Fill this function in                                                
        if(page_free_list == NULL)
                return NULL;

        struct PageInfo* page = page_free_list;
        page_free_list = page->pp_link;
        page->pp_link = 0;
        if(alloc_flags & ALLOC_ZERO)
                memset(page2kva(page), 0, PGSIZE);
        return page;
}
void
page_free(struct PageInfo *pp)
{
        // Fill this function in                                                
        // Hint: You may want to panic if pp->pp_ref is nonzero or              
        // pp->pp_link is not NULL.                                             
        if(pp->pp_link != 0  || pp->pp_ref != 0)
                panic("page_free: this page is not ready!");
        pp->pp_link = page_free_list;
        page_free_list = pp;
        return;
}
#+END_SRC

Exercise finished!

** Part 2: Virtual Memory
