Note/MIT6.828.lab2.html

<li><a id="org5f1cdac"></a><code>page_init</code><br />
<div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">
<pre class="src src-c"> <span style="color: #8ae234; font-weight: bold;">void</span>
 <span style="color: #edd400; font-weight: bold;">page_init</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">void</span><span style="color: #ffd700;">)</span>
 <span style="color: #ffd700;">{</span>
 <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">The example code here marks all physical pages as free.              </span>
 <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">However this is not truly the case.  What memory is free?            </span>
 <span style="color: #888a85; font-style: italic;">//  </span><span style="color: #888a85; font-style: italic;">1) Mark physical page 0 as in use.                                  </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">This way we preserve the real-mode IDT and BIOS structures       </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">in case we ever need them.  (Currently we don't, but...)         </span>
 <span style="color: #888a85; font-style: italic;">//  </span><span style="color: #888a85; font-style: italic;">2) The rest of base memory, [PGSIZE, npages_basemem * PGSIZE)       </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">is free.                                                         </span>
 <span style="color: #888a85; font-style: italic;">//  </span><span style="color: #888a85; font-style: italic;">3) Then comes the IO hole [IOPHYSMEM, EXTPHYSMEM), which must       </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">never be allocated.                                              </span>
 <span style="color: #888a85; font-style: italic;">//  </span><span style="color: #888a85; font-style: italic;">4) Then extended memory [EXTPHYSMEM, ...).                          </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">Some of it is in use, some is free. Where is the kernel          </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">in physical memory?  Which pages are already in use for          </span>
 <span style="color: #888a85; font-style: italic;">//     </span><span style="color: #888a85; font-style: italic;">page tables and other data structures?                           </span>
 <span style="color: #888a85; font-style: italic;">//                                                                      </span>
 <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Change the code to reflect this.                                     </span>
 <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">NB: DO NOT actually touch the physical memory corresponding to       </span>
 <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">free pages!                                                          </span>
 <span style="color: #8ae234; font-weight: bold;">size_t</span> <span style="color: #ff6347; font-weight: bold;">i</span>;
 <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span>i = 0; i &lt; npages; i++<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
                  <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>i == 0<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
                          <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">Page 1 as used                                        </span>
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_ref = 1;
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_link = <span style="color: #8ae234; font-weight: bold;">NULL</span>;
                  <span style="color: #ffa500;">}</span>
                  <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>i &lt; npages_basemem<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
                          <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">Rest of base mem as free                              </span>
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_ref = 0;
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_link = page_free_list;
                          page_free_list = &amp;pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>;
                  <span style="color: #ffa500;">}</span>
                  <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>i &gt;= IOPHYSMEM/PGSIZE &amp;&amp; i &lt; EXTPHYSMEM/PGSIZE<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
                          <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">IO hole                                              </span>
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_ref = 1;
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_link = <span style="color: #8ae234; font-weight: bold;">NULL</span>;
                  <span style="color: #ffa500;">}</span>
                  <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>i &gt;= EXTPHYSMEM/PGSIZE &amp;&amp;
                          i &lt; PADDR<span style="color: #ff7f50;">(</span>boot_alloc<span style="color: #00ff00;">(</span>0<span style="color: #00ff00;">)</span><span style="color: #ff7f50;">)</span>/PGSIZE<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_ref = 1;
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_link = <span style="color: #8ae234; font-weight: bold;">NULL</span>;
                  <span style="color: #ffa500;">}</span>
                  <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #ffa500;">{</span>
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_ref = 0;
                          pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>.pp_link = page_free_list;
                          page_free_list = &amp;pages<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span>;
                  <span style="color: #ffa500;">}</span>
          <span style="color: #00bfff;">}</span>
  <span style="color: #ffd700;">}</span>
</pre>
</div>
</div>
</li>

<li><a id="orge110f27"></a><code>page_alloc</code> and <code>page_free</code><br />
<div class="outline-text-5" id="text-1-1-2-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">PageInfo</span> *
<span style="color: #edd400; font-weight: bold;">page_alloc</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">alloc_flags</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Fill this function in                                                </span>
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00bfff;">(</span>page_free_list == <span style="color: #8ae234; font-weight: bold;">NULL</span><span style="color: #00bfff;">)</span>
                <span style="color: #729fcf; font-weight: bold;">return</span> <span style="color: #8ae234; font-weight: bold;">NULL</span>;

        <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">PageInfo</span>* <span style="color: #ff6347; font-weight: bold;">page</span> = page_free_list;
        page_free_list = page-&gt;pp_link;
        page-&gt;pp_link = 0;
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00bfff;">(</span>alloc_flags &amp; ALLOC_ZERO<span style="color: #00bfff;">)</span>
                memset<span style="color: #00bfff;">(</span>page2kva<span style="color: #ffa500;">(</span>page<span style="color: #ffa500;">)</span>, 0, PGSIZE<span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">return</span> page;
<span style="color: #ffd700;">}</span>
<span style="color: #8ae234; font-weight: bold;">void</span>
<span style="color: #edd400; font-weight: bold;">page_free</span><span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">PageInfo</span> *<span style="color: #ff6347; font-weight: bold;">pp</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Fill this function in                                                </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Hint: You may want to panic if pp-&gt;pp_ref is nonzero or              </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">pp-&gt;pp_link is not NULL.                                             </span>
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00bfff;">(</span>pp-&gt;pp_link != 0  || pp-&gt;pp_ref != 0<span style="color: #00bfff;">)</span>
                panic<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"page_free: this page is not ready!"</span><span style="color: #00bfff;">)</span>;
        pp-&gt;pp_link = page_free_list;
        page_free_list = pp;
        <span style="color: #729fcf; font-weight: bold;">return</span>;
<span style="color: #ffd700;">}</span>
</pre>
</div>

<p>
Exercise finished!
</p>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org1b4d737" class="outline-2">
<h2 id="org1b4d737"><span class="section-number-2">2</span> Part 2: Virtual Memory</h2>
<div class="outline-text-2" id="text-2">
</div>
