Note/MIT6.828.lab2.html
<div id="outline-container-orgb9e2dfc" class="outline-3">
<h3 id="orgb9e2dfc"><span class="section-number-3">2.1</span> Exercise 2</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
Look at chapters 5 and 6 of the Intel 80386 Reference Manual, if you haven't done so already. 
Read the sections about page translation and page-based protection closely (5.2 and 6.4). 
We recommend that you also skim the sections about segmentation; 
while JOS uses the paging hardware for virtual memory and protection, 
segment translation and segment-based protection cannot be disabled on the x86, so you will need a basic understanding of it.
</p>
</blockquote>
<p>
I like this setting as I dislike segment strategy&#x2026;
</p>

<pre class="example">
           Selector  +--------------+         +-----------+
          ----------&gt;|              |         |           |
                     | Segmentation |         |  Paging   |
Software             |              |--------&gt;|           |----------&gt;  RAM
            Offset   |  Mechanism   |         | Mechanism |
          ----------&gt;|              |         |           |
                     +--------------+         +-----------+
            Virtual                   Linear                Physical
</pre>
<p>
Done!
</p>
</div>
</div>

<div id="outline-container-org2e2b636" class="outline-3">
<h3 id="org2e2b636"><span class="section-number-3">2.2</span> Exercise 3</h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
While GDB can only access QEMU's memory by virtual address, 
it's often useful to be able to inspect physical memory while setting up virtual memory. 
Review the QEMU monitor commands from the lab tools guide, especially the xp command, 
which lets you inspect physical memory. 
To access the QEMU monitor, press <code>Ctrl-a c</code> in the terminal (the same binding returns to the serial console).
</p>

<p>
Use the <code>xp</code> command in the QEMU monitor and the x command in GDB to inspect memory at 
corresponding physical and virtual addresses and make sure you see the same data.
</p>

<p>
Our patched version of QEMU provides an <code>info pg</code> command that may also prove useful: 
it shows a compact but detailed representation of the current page tables, including all mapped memory ranges, permissions, and flags. 
Stock QEMU also provides an info mem command that shows an overview of which ranges of virtual addresses are mapped and with what permissions.
</p>
</blockquote>

<p>
QEMU's monitor command:
</p>
<ul class="org-ul">
<li><p>
<code>xp/Nx paddr</code> 
</p>

<p>
Display a hex dump of N words starting at physical address paddr. 
If N is omitted, it defaults to 1. This is the physical memory analogue of GDB's x command.
</p></li>

<li><p>
<code>info registers</code> 
</p>

<p>
Display a full dump of the machine's internal register state. 
In particular, this includes the machine's hidden segment state for the segment selectors and the local, global, and 
interrupt descriptor tables, plus the task register. 
This hidden state is the information the virtual CPU read from the GDT/LDT when the segment selector was loaded.
</p></li>
</ul>

<p>
To help document the code, in JOS, type <code>uintptr_t</code> and <code>physaddr_t</code> are just synonyms for <code>uint32_t</code> .
</p>
</div>

<div id="outline-container-orgac7c281" class="outline-4">
<h4 id="orgac7c281"><span class="section-number-4">2.2.1</span> Question</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>Solution: type is uintptr<sub>t</sub> since it's used as virtual addr.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org451f040" class="outline-3">
<h3 id="org451f040"><span class="section-number-3">2.3</span> Exercise 4</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
In the file kern/pmap.c, you must implement code for the following functions.
</p>
<pre class="example">
        pgdir_walk()
        boot_map_region()
        page_lookup()
        page_remove()
        page_insert()
</pre>

<p>
<code>check_page()</code>, called from <code>mem_init()</code>, tests your page table management routines. You should make sure it reports success before proceeding.
</p>
</blockquote>
</div>
</div>
</div>


<div id="outline-container-org6305f53" class="outline-2">
<h2 id="org6305f53"><span class="section-number-2">3</span> Part 3: Kernel Address Space</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-07-06 Mon 22:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
